Documents/ПутевойЛистЛегковогоАвтомобиля.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Document>
		<Properties>
			<Name>ПутевойЛистЛегковогоАвтомобиля</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаС</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПо</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автомобиль</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Автомобили</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Водитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Выезды</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЗимаЛето</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Число</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВремяВыезда</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Time</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВремяВозвращения</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Time</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВНаряде</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Time</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СпидометрПриВыезде</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СпидометрПриВозвращении</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Пробег</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОстатокТопливаПриВыезде</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОстатокТопливаПриВозвращении</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗаправленоТоплива</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РасходТопливаПоНорме</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РасходТопливаПоФакту</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЭкономияПерерасход</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/ПутевойЛистЛегковогоАвтомобиля/Forms/ФормаДокумента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ДатаСПриИзменении(Элемент)
	Объект.ДатаС = НачалоДня(Дата(Элемент.ТекстРедактирования + " 01:01:01"));
КонецПроцедуры

&НаКлиенте
Процедура ДатаПоПриИзменении(Элемент)
	Объект.ДатаПо = КонецДня(Дата(Элемент.ТекстРедактирования + " 01:01:01"));
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыПутевойЛист

&НаКлиенте
Процедура ПутевойЛистВремяВыездаПриИзменении(Элемент)
	ПересчетСтрокиПЛ();
КонецПроцедуры

&НаКлиенте
Процедура ПутевойЛистВремяВозвращенияПриИзменении(Элемент)
	ПересчетСтрокиПЛ();
КонецПроцедуры

&НаКлиенте
Процедура ПутевойЛистСпидометрПриВыездеПриИзменении(Элемент)
	ПересчетСтрокиПЛ();
КонецПроцедуры

&НаКлиенте
Процедура ПутевойЛистСпидометрПриВозвращенииПриИзменении(Элемент)
	ПересчетСтрокиПЛ();
КонецПроцедуры

&НаКлиенте
Процедура ПутевойЛистОстатокТопливаПриВыездеПриИзменении(Элемент)
	ПересчетСтрокиПЛ();
КонецПроцедуры

&НаКлиенте
Процедура ПутевойЛистРасходТопливаПоФактуПриИзменении(Элемент)
	ПересчетСтрокиПЛ();
КонецПроцедуры

&НаКлиенте
Процедура ПутевойЛистПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	КоличествоСтрокПЛ = Объект.Выезды.Количество();
	Если КоличествоСтрокПЛ > 1 И Элемент.ТекущиеДанные.НомерСтроки = КоличествоСтрокПЛ Тогда
		Элемент.ТекущиеДанные.СпидометрПриВыезде = Объект.Выезды[КоличествоСтрокПЛ-2].СпидометрПриВозвращении;
		Элемент.ТекущиеДанные.Число = Объект.Выезды[КоличествоСтрокПЛ-2].Число + ОбщегоНазначенияСервер.ПолучитьКонстантуССекундами();
		Элемент.ТекущиеДанные.ОстатокТопливаПриВыезде = Объект.Выезды[КоличествоСтрокПЛ-2].ОстатокТопливаПриВозвращении;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПутевойЛистЗимаЛетоПриИзменении(Элемент)
	ПересчетСтрокиПЛ();
КонецПроцедуры

&НаКлиенте
Процедура ПересчетСтрокиПЛ()
	СтрокаПЛ =  Элементы.ПутевойЛист.ТекущиеДанные;
	СтрокаПЛ.ВНаряде = СтрокаПЛ.Число + (СтрокаПЛ.ВремяВозвращения - СтрокаПЛ.ВремяВыезда);
	СтрокаПЛ.Пробег = СтрокаПЛ.СпидометрПриВозвращении - СтрокаПЛ.СпидометрПриВыезде;
	а = ?(СтрокаПЛ.ЗимаЛето, "Зима", "Лето");
	СтрокаПЛ.РасходТопливаПоНорме = ПолучитьРасходТоплива(а)/100*СтрокаПЛ.Пробег;
	СтрокаПЛ.ЭкономияПерерасход = СтрокаПЛ.РасходТопливаПоНорме - СтрокаПЛ.РасходТопливаПоФакту;
	СтрокаПЛ.ОстатокТопливаПриВозвращении = СтрокаПЛ.ОстатокТопливаПриВыезде - СтрокаПЛ.РасходТопливаПоФакту + СтрокаПЛ.ЗаправленоТоплива;
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ПолучитьРасходТоплива(ЗимаЛето)
	Если ЗимаЛето = "Зима" Тогда
		Возврат Объект.Автомобиль.НормаРасходаТопливаЗима;
	Иначе 
		Возврат Объект.Автомобиль.НормаРасходаТопливаЛето;
	КонецЕсли;
КонецФункции

#КонецОбласти
